results/springboot/c6i.xlarge/wrk4.log
===== Spring Boot Benchmark (wrk) =====
Instance Type: c6i.xlarge
Spring Boot Host: springboot-server-c6i-xlarge

--- Warm-up Phase (30s) ---
Warm-up complete

--- Main Page - 2 threads, 50 connections, 60s ---
Running 1m test @ http://springboot-server-c6i-xlarge:8080/
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.06ms  434.12us  31.28ms   83.42%
    Req/Sec    23.53k     0.96k   44.46k    81.85%
  Latency Distribution
     50%    1.02ms
     75%    1.17ms
     90%    1.41ms
     99%    2.25ms
  2811531 requests in 1.00m, 375.89MB read
Requests/sec:  46780.80
Transfer/sec:      6.25MB

--- Main Page - 2 threads, 100 connections, 60s ---
Running 1m test @ http://springboot-server-c6i-xlarge:8080/
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.01ms  601.64us  23.62ms   75.84%
    Req/Sec    24.62k     0.86k   27.38k    72.83%
  Latency Distribution
     50%    1.99ms
     75%    2.26ms
     90%    2.69ms
     99%    3.75ms
  2940106 requests in 1.00m, 393.08MB read
Requests/sec:  48959.57
Transfer/sec:      6.55MB

--- High Load - 2 threads, 200 connections, 30s ---
Running 30s test @ http://springboot-server-c6i-xlarge:8080/
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.98ms    1.18ms  40.93ms   76.04%
    Req/Sec    25.06k     1.38k   27.95k    86.79%
  Latency Distribution
     50%    3.90ms
     75%    4.48ms
     90%    5.36ms
     99%    7.38ms
  1491459 requests in 30.08s, 199.40MB read
Requests/sec:  49585.99
Transfer/sec:      6.63MB

===== Spring Boot Benchmark Complete =====